[{"title": "NASA's MAVEN Explores Mars to Understand Radio Interference at Earth", "preview": "NASA’s MAVEN spacecraft has discovered “layers” and “rifts” in the electrically charged part of the upper atmosphere of Mars."}, {"title": "8 Martian Postcards to Celebrate Curiosity's Landing Anniversary", "preview": "The NASA rover touched down eight years ago, on Aug. 5, 2012, and will soon be joined by a second rover, Perseverance."}, {"title": "Virginia Middle School Student Earns Honor of Naming NASA's Next Mars Rover", "preview": "NASA chose a seventh-grader from Virginia as winner of the agency's \"Name the Rover\" essay contest. Alexander Mather's entry for \"Perseverance\" was voted tops among 28,000 entries. "}, {"title": "NASA, ULA Launch Mars 2020 Perseverance Rover Mission to Red Planet", "preview": "The agency's Mars 2020 mission is on its way. It will land at Jezero Crater in about seven months, on Feb. 18, 2021. "}, {"title": "NASA Adds Return Sample Scientists to Mars 2020 Leadership Team", "preview": "The leadership council for Mars 2020 science added two new members who represent the interests of scientists destined to handle and study the first samples from Red Planet."}, {"title": "NASA Moves Forward With Campaign to Return Mars Samples to Earth", "preview": "During this next phase, the program will mature critical technologies and make critical design decisions as well as assess industry partnerships."}, {"title": "NASA's Curiosity Rover Finds an Ancient Oasis on Mars", "preview": "New evidence suggests salty, shallow ponds once dotted a Martian crater — a sign of the planet's drying climate."}, {"title": "NASA's MAVEN Observes Martian Night Sky Pulsing in Ultraviolet Light", "preview": "Vast areas of the Martian night sky pulse in ultraviolet light, according to images from NASA’s MAVEN spacecraft. The results are being used to illuminate complex circulation patterns in the Martian atmosphere."}, {"title": "NASA's Mars Reconnaissance Orbiter Undergoes Memory Update", "preview": "Other orbiters will continue relaying data from Mars surface missions for a two-week period."}, {"title": "NASA Wins Two Emmy Awards for Interactive Mission Coverage", "preview": "NASA-JPL's coverage of the Mars InSight landing earns one of the two wins, making this the NASA center's second Emmy."}, {"title": "MOXIE Could Help Future Rockets Launch Off Mars", "preview": "NASA's Perseverance rover carries a device to convert Martian air into oxygen that, if produced on a larger scale, could be used not just for breathing, but also for fuel."}, {"title": "How NASA's Mars Helicopter Will Reach the Red Planet's Surface", "preview": "The small craft will seek to prove that powered, controlled flight is possible on another planet. But just getting it onto the surface of Mars will take a whole lot of ingenuity."}, {"title": "NASA's Mars Helicopter Attached to Mars 2020 Rover ", "preview": "The helicopter will be first aircraft to perform flight tests on another planet."}, {"title": "5 Hidden Gems Are Riding Aboard NASA's Perseverance Rover", "preview": "The symbols, mottos, and small objects added to the agency's newest Mars rover serve a variety of purposes, from functional to decorative."}, {"title": "Join NASA for the Launch of the Mars 2020 Perseverance Rover", "preview": "No matter where you live, choose from a menu of activities to join NASA as we \"Countdown to Mars\" and launch the Perseverance rover to the Red Planet."}]